Revit 2027 API
IFCParameterTemplate.GetOrCreateInSessionTemplate Method
 Gets the in-session non-serializable template or create new.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IFCParameterTemplate GetOrCreateInSessionTemplate(
	Document document
)
Public Shared Function GetOrCreateInSessionTemplate (
	document As Document
) As IFCParameterTemplate
public:
static IFCParameterTemplate^ GetOrCreateInSessionTemplate(
	Document^ document
)
static member GetOrCreateInSessionTemplate :
        document : Document -> IFCParameterTemplate
Parameters
document Document
 The document where created mapping template is saved.
Return Value
IFCParameterTemplate
 The mapping template.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCParameterTemplate Class
Autodesk.Revit.DB Namespace